Ran Plan for project: `demo` dir: `.infra/terraform` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_iam_policy.iam_policy_rds will be created
+ resource "aws_iam_policy" "iam_policy_rds" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "Demo-Medplum-Rds"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "rds:*"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:rds:us-east-2:969158125505:db:medplum-core-nonprod",
                          + "arn:aws:rds:us-east-2:347383665746:snapshot:*",
                        ]
                      + Sid      = "Stmt1679439991987"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Confidentiality" = "sensitive"
          + "Contact"         = "slack/eng-infra-support"
          + "Environment"     = "demo"
          + "ManagedBy"       = "terraform"
          + "Project"         = "medplum"
          + "Repo"            = "https://github.com/ThirtyMadison/medplum"
          + "Team"            = "infra-dx"
        }
    }

  # aws_iam_role_policy_attachment.attach_rds_policy will be created
+ resource "aws_iam_role_policy_attachment" "attach_rds_policy" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "K8-ServiceAccount-IAMRole-Medplum"
    }

Plan: 2 to add, 0 to change, 0 to destroy.
╷
│ Warning: Value for undeclared variable
│ 
│ The root module does not declare a variable named "vault_identifier" but a
│ value was found in file "env/demo.tfvars". If you meant to use this value,
│ add a "variable" block to the configuration.
│ 
│ To silence these warnings, use TF_VAR_... environment variables to provide
│ certain "global" settings to all configurations in your organization. To
│ reduce the verbosity of these warnings, use the -compact-warnings option.
╵
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p demo`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.ffar0wwu.com/lock?id=ThirtyMadison%252Fmedplum%252F.infra%252Fterraform%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p demo`
</details>
Plan: 2 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To **delete** all plans and locks for the PR, comment:
    * `atlantis unlock`